In [1]:
# Import modules
from bs4 import BeautifulSoup
import requests
from splinter import Browser
from selenium import webdriver
import pandas as pd
import time
from secret import username, password
from sqlalchemy import create_engine
import csv
import numpy as np
import html5lib

### Mac (Irina) Connection

In [2]:
# https://splinter.readthedocs.io/en/latest/drivers/chrome.html
!which chromedriver

/usr/local/bin/chromedriver

In [3]:
executable_path = {'executable_path': '/usr/local/bin/chromedriver'}
browser = Browser('chrome', **executable_path, headless=False)

### Windows (Clay) Connection

In [4]:
# executable_path = {'executable_path': 'C:/Users/Clay/chromedriver.exe'}
# browser = Browser('chrome', **executable_path, headless=False)

### Dataset 1 - Web Scrape Box Office Mojo

In [4]:
mojo_list = []
base_url = 'https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW'
page_num = 0
table_mojo_test_df = []

for i in range(0, 10000, 200):
    if page_num < 100:
        print("Printing first 200 rows.")
        url=(f"{base_url}")
        print(url)
##         Mac (Irina)
        executable_path = {'executable_path': '/usr/local/bin/chromedriver'}
##         Windows (Clay)
#         executable_path = {'executable_path': 'C:/Users/Clay/chromedriver.exe'}
        browser = Browser('chrome', **executable_path, headless=False)
        browser.visit(url)
        time.sleep(3)
        print("Open web browser")
        tables = pd.read_html(url)
        time.sleep(3)
        table_mojo_df = tables[0] # Create table from the first page
        print("Read and save table")
        browser.quit()
        page_num += 200
        table_mojo_test_df = table_mojo_df
        print('-------------------------------------')
    else:
        print(f"Printing pages {i+1} to {i+200}")
        url=(f"{base_url}&offset={str(i)}")
        print(url)
##         Mac (Irina)
        executable_path = {'executable_path': '/usr/local/bin/chromedriver'}
##         Windows (Clay)
#         executable_path = {'executable_path': 'C:/Users/Clay/chromedriver.exe'}
        browser = Browser('chrome', **executable_path, headless=False)
        browser.visit(url)
        time.sleep(3)
        print("Open web browser")
        tables = pd.read_html(url)
        time.sleep(3)
        table_temp = tables[0]
        print("Read and save table")
        browser.quit()
        page_num += 200
        table_mojo_test_df = table_mojo_test_df.append(table_temp)
        print('-------------------------------------')

Printing first 200 rows.
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW
Open web browser
Read and save table
-------------------------------------
Printing pages 201 to 400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=200
Open web browser
Read and save table
-------------------------------------
Printing pages 401 to 600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=400
Open web browser
Read and save table
-------------------------------------
Printing pages 601 to 800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=600
Open web browser
Read and save table
-------------------------------------
Printing pages 801 to 1000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=800
Open web browser
Read and save table
-------------------------------------
Printing pages 1001 to 1200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=1000
Open web browser
Read and save table
-------------------------------------
Printing pages 1201 to 1400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=1200
Open web browser
Read and save table
-------------------------------------
Printing pages 1401 to 1600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=1400
Open web browser
Read and save table
-------------------------------------
Printing pages 1601 to 1800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=1600
Open web browser
Read and save table
-------------------------------------
Printing pages 1801 to 2000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=1800
Open web browser
Read and save table
-------------------------------------
Printing pages 2001 to 2200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=2000
Open web browser
Read and save table
-------------------------------------
Printing pages 2201 to 2400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=2200
Open web browser
Read and save table
-------------------------------------
Printing pages 2401 to 2600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=2400
Open web browser
Read and save table
-------------------------------------
Printing pages 2601 to 2800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=2600
Open web browser
Read and save table
-------------------------------------
Printing pages 2801 to 3000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=2800
Open web browser
Read and save table
-------------------------------------
Printing pages 3001 to 3200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=3000
Open web browser
Read and save table
-------------------------------------
Printing pages 3201 to 3400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=3200
Open web browser
Read and save table
-------------------------------------
Printing pages 3401 to 3600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=3400
Open web browser
Read and save table
-------------------------------------
Printing pages 3601 to 3800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=3600
Open web browser
Read and save table
-------------------------------------
Printing pages 3801 to 4000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=3800
Open web browser
Read and save table
-------------------------------------
Printing pages 4001 to 4200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=4000
Open web browser
Read and save table
-------------------------------------
Printing pages 4201 to 4400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=4200
Open web browser
Read and save table
-------------------------------------
Printing pages 4401 to 4600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=4400
Open web browser
Read and save table
-------------------------------------
Printing pages 4601 to 4800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=4600
Open web browser
Read and save table
-------------------------------------
Printing pages 4801 to 5000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=4800
Open web browser
Read and save table
-------------------------------------
Printing pages 5001 to 5200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=5000
Open web browser
Read and save table
-------------------------------------
Printing pages 5201 to 5400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=5200
Open web browser
Read and save table
-------------------------------------
Printing pages 5401 to 5600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=5400
Open web browser
Read and save table
-------------------------------------
Printing pages 5601 to 5800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=5600
Open web browser
Read and save table
-------------------------------------
Printing pages 5801 to 6000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=5800
Open web browser
Read and save table
-------------------------------------
Printing pages 6001 to 6200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=6000
Open web browser
Read and save table
-------------------------------------
Printing pages 6201 to 6400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=6200
Open web browser
Read and save table
-------------------------------------
Printing pages 6401 to 6600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=6400
Open web browser
Read and save table
-------------------------------------
Printing pages 6601 to 6800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=6600
Open web browser
Read and save table
-------------------------------------
Printing pages 6801 to 7000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=6800
Open web browser
Read and save table
-------------------------------------
Printing pages 7001 to 7200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=7000
Open web browser
Read and save table
-------------------------------------
Printing pages 7201 to 7400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=7200
Open web browser
Read and save table
-------------------------------------
Printing pages 7401 to 7600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=7400
Open web browser
Read and save table
-------------------------------------
Printing pages 7601 to 7800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=7600
Open web browser
Read and save table
-------------------------------------
Printing pages 7801 to 8000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=7800
Open web browser
Read and save table
-------------------------------------
Printing pages 8001 to 8200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=8000
Open web browser
Read and save table
-------------------------------------
Printing pages 8201 to 8400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=8200
Open web browser
Read and save table
-------------------------------------
Printing pages 8401 to 8600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=8400
Open web browser
Read and save table
-------------------------------------
Printing pages 8601 to 8800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=8600
Open web browser
Read and save table
-------------------------------------
Printing pages 8801 to 9000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=8800
Open web browser
Read and save table
-------------------------------------
Printing pages 9001 to 9200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=9000
Open web browser

Read and save table
-------------------------------------
Printing pages 9201 to 9400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=9200
Open web browser
Read and save table
-------------------------------------
Printing pages 9401 to 9600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=9400
Open web browser
Read and save table
-------------------------------------
Printing pages 9601 to 9800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=9600
Open web browser
Read and save table
-------------------------------------
Printing pages 9801 to 10000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=9800
Open web browser
Read and save table
-------------------------------------

In [5]:
# Save to the csv file
table_mojo_test_df.to_csv("csv_files/Dataset1_Mojo_total_gross_revenue.csv")

In [6]:
table_mojo_test_df.tail(20)

,Rank,Title,Lifetime Gross,Year
180,9981,Inchon,"$5,200,986",1982
181,9982,Jane Eyre,"$5,200,601",1996
182,9983,Kelly's Heroes,"$5,200,000",1970
183,9984,Death Bell 2: Bloody Camp,"$5,198,289",2010
184,9985,L'antidote,"$5,194,913",2005
185,9986,Clara's Heart,"$5,194,491",1988
186,9987,Schuks Tshabalala's Survival Guide to South Af...,"$5,194,418",2010
187,9988,Min søsters børn i Afrika,"$5,194,312",2013
188,9989,Zindagi Na Milegi Dobara,"$5,192,743",2011
189,9990,Yoko,"$5,191,840",2012
190,9991,Nous York,"$5,189,055",2012
191,9992,Sapphire Blue,"$5,188,128",2014
192,9993,Oldboy,"$5,186,767",2013
193,9994,52 Pick-Up,"$5,186,646",1986
194,9995,Little Big Soldier,"$5,186,427",2010
195,9996,Bank Error in Your Favour,"$5,186,282",2009
196,9997,Sales gosses,"$5,184,002",2017
197,9998,Vampire Sisters 2: Bats in the Belly,"$5,182,195",2014
198,9999,Born in the Exile: Sandaime J Soul Brothers no...,"$5,181,032",2016
199,10000,All-Round Appraiser Q: The Eyes of Mona Lisa,"$5,180,116",2014

# Prepare total gross revenue data set

In [5]:
# Read the clean, combined csv file
master_df = pd.read_csv("csv_files/Dataset1_Mojo_total_gross_revenue.csv")

In [6]:
# Getting the duplicate movie by title and year released. 
duplicated_master_df = master_df.loc[master_df.duplicated(subset=["Title","Year"]), "Title"].unique()
duplicated_master_df

array(['War of the Buttons', 'My Love'], dtype=object)

In [7]:
# Get all the data for the duplicate movie 
duplicated_master_df = master_df.loc[master_df["Title"] == "War of the Buttons"]
duplicated_master_df

      Unnamed: 0  Rank               Title Lifetime Gross  Year
5984         184  5985  War of the Buttons    $15,082,409  2011
6646          46  6647  War of the Buttons    $12,326,773  2011

In [8]:
# Get all the data for the duplicate movie 
duplicated_master_df = master_df.loc[master_df["Title"] == "My Love"]
duplicated_master_df

      Unnamed: 0  Rank    Title Lifetime Gross  Year
5335         135  5336  My Love    $18,525,631  2007
8996         196  8997  My Love     $6,660,413  2007

In [9]:
# reset index
master_df.reset_index()

,index,Unnamed: 0,Rank,Title,Lifetime Gross,Year
0,0,0,1,Avengers: Endgame,"$2,797,800,564",2019
1,1,1,2,Avatar,"$2,790,439,000",2009
2,2,2,3,Titanic,"$2,195,169,138",1997
3,3,3,4,Star Wars: Episode VII - The Force Awakens,"$2,068,223,624",2015
4,4,4,5,Avengers: Infinity War,"$2,048,359,754",2018
...,...,...,...,...,...,...
9995,9995,195,9996,Bank Error in Your Favour,"$5,186,282",2009
9996,9996,196,9997,Sales gosses,"$5,184,002",2017
9997,9997,197,9998,Vampire Sisters 2: Bats in the Belly,"$5,182,195",2014
9998,9998,198,9999,Born in the Exile: Sandaime J Soul Brothers no...,"$5,181,032",2016
9999,9999,199,10000,All-Round Appraiser Q: The Eyes of Mona Lisa,"$5,180,116",2014

In [10]:
# Drop row by index. Note: this index might change in if original data changes
total_gross_info = master_df.drop(index=master_df.index[[6646, 8996]])
# See index from above

In [11]:
len(total_gross_info)

9998

In [12]:
# Select columns
total_gross_info = total_gross_info[['Rank', 'Title', 'Year', 'Lifetime Gross']]

In [13]:
# Rename columns
total_gross_info = total_gross_info.rename(columns={'Rank': 'rank', 'Title': 'name', 
                'Year': 'year', 'GrossNumeric': 'total_revenue_usd'})

In [14]:
# total_gross_info.set_index('rank', inplace=True)

In [15]:
total_gross_info.head()

   rank                                        name  year  Lifetime Gross
0     1                           Avengers: Endgame  2019  $2,797,800,564
1     2                                      Avatar  2009  $2,790,439,000
2     3                                     Titanic  1997  $2,195,169,138
3     4  Star Wars: Episode VII - The Force Awakens  2015  $2,068,223,624
4     5                      Avengers: Infinity War  2018  $2,048,359,754

In [16]:
# Change name column to lower case to easier join 
total_gross_info['name'] = total_gross_info['name'].str.capitalize()

In [17]:
# Drop year column
total_gross_info = total_gross_info.drop(columns='year')

In [18]:
# Rename Lifetime Gross to total_revenue_usd
total_gross_info = total_gross_info.rename(columns={'Lifetime Gross': 'total_revenue_usd'})

In [19]:
total_gross_info

,rank,name,total_revenue_usd
0,1,Avengers: endgame,"$2,797,800,564"
1,2,Avatar,"$2,790,439,000"
2,3,Titanic,"$2,195,169,138"
3,4,Star wars: episode vii - the force awakens,"$2,068,223,624"
4,5,Avengers: infinity war,"$2,048,359,754"
...,...,...,...
9995,9996,Bank error in your favour,"$5,186,282"
9996,9997,Sales gosses,"$5,184,002"
9997,9998,Vampire sisters 2: bats in the belly,"$5,182,195"
9998,9999,Born in the exile: sandaime j soul brothers no...,"$5,181,032"
9999,10000,All-round appraiser q: the eyes of mona lisa,"$5,180,116"

In [20]:
# Convert total_revenue_usd to Integer
tot_rev_usd = total_gross_info['total_revenue_usd']
len(tot_rev_usd)

9998

In [21]:
list = []
for i in tot_rev_usd:
    list.append(i.split('$')[-1]) 
print(list[:10])

['2,797,800,564', '2,790,439,000', '2,195,169,138', '2,068,223,624', '2,048,359,754', '1,670,400,637', '1,656,943,394', '1,518,812,988', '1,515,048,151', '1,450,026,933']

In [22]:
split_list = []
for i in list:
    i = i.split(',')
    split_list.append(''.join(i))

In [23]:
merged_list = []
for i in split_list:
    merged_list.append(''.join(i)) 
print(merged_list[:5])

['2797800564', '2790439000', '2195169138', '2068223624', '2048359754']

In [24]:
len(merged_list)

9998

In [25]:
# Change revenue column from string to big integer
total_gross_info['total_revenue_usd'] = merged_list

In [26]:
total_gross_info['total_revenue_usd'] = pd.to_numeric(total_gross_info['total_revenue_usd'])

In [27]:
total_gross_info.dtypes

rank                  int64
name                 object
total_revenue_usd     int64
dtype: object

In [28]:
total_gross_info.to_csv('csv_files/Total_Gross_Info.csv')

In [29]:
# # Connect to the local database
# connection_string = f'{username}:{password}@localhost:5432/movies_db'
# engine = create_engine(f'postgresql://{connection_string}')

In [30]:
# # Push total gross revenue table into the database
# total_gross_info.to_sql(name='total_gross_info', con=engine, if_exists='append', index=False)

## Dataset 2 - Kaggle domestic revenue data - Load and clean¶
#### Please download source data set - https://www.kaggle.com/danielgrijalvas/movies?select=movies.csv
#### Save in 'csv_files/datasets_2745_4700_movies.csv'

In [31]:
path = 'csv_files/datasets_2745_4700_movies.csv'

In [32]:
# Convert all rows to UTF-8 type and write to a new file
with open(path, 'r', encoding='utf-8', errors='ignore') as infile, open(path + '_UTF8.csv', 'w') as outfile:
     inputs = csv.reader(infile)
     output = csv.writer(outfile)

     for index, row in enumerate(inputs):
         # Create file with no header
         if index == 0:
             continue
         output.writerow(row)

In [33]:
# Read csv file into df
domestic_df = pd.read_csv('csv_files/datasets_2745_4700_movies.csv_UTF8.csv')

In [34]:
# Add header 
domestic_df.columns = ["budget","company","country","director","genre","gross","name","rating","released","runtime","score","star","votes","writer","year"]

In [35]:
domestic_df.head(2)

,budget,company,country,director,genre,gross,name,rating,released,runtime,score,star,votes,writer,year
0,6000000,Paramount Pictures,USA,John Hughes,Comedy,70136369,Ferris Bueller's Day Off,PG-13,6/11/86,103,7.8,Matthew Broderick,264740,John Hughes,1986
1,15000000,Paramount Pictures,USA,Tony Scott,Action,179800601,Top Gun,PG,5/16/86,110,6.9,Tom Cruise,236909,Jim Cash,1986

In [36]:
# Make names capitalized
domestic_df['name'] = domestic_df['name'].str.capitalize()

In [37]:
domestic_df.head(2)

,budget,company,country,director,genre,gross,name,rating,released,runtime,score,star,votes,writer,year
0,6000000,Paramount Pictures,USA,John Hughes,Comedy,70136369,Ferris bueller's day off,PG-13,6/11/86,103,7.8,Matthew Broderick,264740,John Hughes,1986
1,15000000,Paramount Pictures,USA,Tony Scott,Action,179800601,Top gun,PG,5/16/86,110,6.9,Tom Cruise,236909,Jim Cash,1986

In [38]:
# Getting the duplicate movies
duplicated_domestic_df = domestic_df.loc[domestic_df.duplicated(subset=["name","director"]), "name"].unique()
duplicated_domestic_df

array([], dtype=object)

In [39]:
# Getting the duplicate movie by title and star released. 
duplicated_domestic_df = domestic_df.loc[domestic_df.duplicated(subset=["name","star"]), "name"].unique()
duplicated_domestic_df

array([], dtype=object)

In [40]:
# Getting the duplicate movie by title and country released. 
duplicated_domestic_df = domestic_df.loc[domestic_df.duplicated(subset=["name","country"]), "name"].unique()
duplicated_domestic_df

array(['Dream lover', "Nobody's fool", 'Heat', 'It takes two',
       'Rumpelstiltskin', 'Bulletproof', 'Gladiator',
       'Where the heart is', 'Hamlet', 'The in crowd',
       'Behind enemy lines', 'Out cold', 'Bad company', 'Crossroads',
       'The rookie', 'The hunted', 'It runs in the family',
       'Man of the house', 'The guardian', 'Pulse', 'Hairspray',
       'The hitcher', 'Twilight', 'The unborn', 'Fair game',
       'Death at a funeral', 'Morning glory', 'Trespass', 'The avengers',
       'Les misrables', 'Project x', 'Playing for keeps', 'Promised land',
       'Frozen', 'Hercules', 'Godzilla', 'Robocop',
       'Teenage mutant ninja turtles', 'The gift', 'Fantastic four',
       'No escape', 'Hot pursuit', 'Sing', 'Passengers', 'Masterminds'],
      dtype=object)

In [41]:
# Check duplicated movie
duplicated_domestic_df = domestic_df.loc[domestic_df["name"] == "Godzilla"]
duplicated_domestic_df

,budget,company,country,director,genre,gross,name,rating,released,runtime,score,star,votes,writer,year
2683,130000000,Centropolis Film Productions,USA,Roland Emmerich,Action,136314294,Godzilla,PG-13,5/20/98,139,5.3,Matthew Broderick,160038,Dean Devlin,1998
6207,160000000,Warner Bros.,USA,Gareth Edwards,Action,200676069,Godzilla,PG-13,5/16/14,123,6.4,Aaron Taylor-Johnson,323734,Max Borenstein,2014

In [42]:
# Rename gross to domestic_revenue_usd
domestic_gross_info = domestic_df.rename(columns={'gross': 'domestic_revenue_usd'})

In [43]:
# Rename released to release_date
domestic_gross_info = domestic_gross_info.rename(columns={'released': 'release_date'})

In [44]:
# Drop columns we do not need ('budget', 'runtime', 'score', 'votes', 'year')
domestic_gross_info = domestic_gross_info.drop(columns=['budget', 'runtime', 'score', 'votes'])

In [45]:
domestic_gross_info.head(2)

,company,country,director,genre,domestic_revenue_usd,name,rating,release_date,star,writer,year
0,Paramount Pictures,USA,John Hughes,Comedy,70136369,Ferris bueller's day off,PG-13,6/11/86,Matthew Broderick,John Hughes,1986
1,Paramount Pictures,USA,Tony Scott,Action,179800601,Top gun,PG,5/16/86,Tom Cruise,Jim Cash,1986

In [46]:
domestic_gross_info.dtypes

company                 object
country                 object
director                object
genre                   object
domestic_revenue_usd     int64
name                    object
rating                  object
release_date            object
star                    object
writer                  object
year                     int64
dtype: object

In [47]:
# Change release_date to datetime type
domestic_gross_info['release_date'] = pd.to_datetime(domestic_gross_info['release_date'])

In [48]:
domestic_gross_info.dtypes

company                         object
country                         object
director                        object
genre                           object
domestic_revenue_usd             int64
name                            object
rating                          object
release_date            datetime64[ns]
star                            object
writer                          object
year                             int64
dtype: object

In [49]:
# Write to csv file
domestic_gross_info.to_csv('csv_files/Domestic_Gross_Info.csv')

In [50]:
# TO THIS POINT, WE HAVE CREATED TWO MASTER DATAFRAMES THAT ARE CLEAN:
# (1) Total_Gross_Info.csv
# (2) Domestic_Gross_Info.csv

#### (removed) Use pandas to push data into database

In [51]:
# # Check existing tables
# engine.table_names()

In [52]:
# # Create domesic gross revenue table in the database
# domestic_gross_info.to_sql(name='domestic_gross_info', con=engine, if_exists='append', index=False)

In [53]:
# type(total_gross_info['name'])

In [54]:
# total_gross_info

In [55]:
# domestic_gross_info

### Merge total_gross_info and domestic_gross_info tables on 'name' column

In [56]:
# combine total and domestic tables on left using name of the movie column
combined_gross_info = pd.merge(domestic_gross_info, total_gross_info, how='left', on="name")

In [57]:
combined_gross_info.head()

,company,country,director,genre,domestic_revenue_usd,name,rating,release_date,star,writer,year,rank,total_revenue_usd
0,Paramount Pictures,USA,John Hughes,Comedy,70136369,Ferris bueller's day off,PG-13,1986-06-11,Matthew Broderick,John Hughes,1986,2205.0,70712677.0
1,Paramount Pictures,USA,Tony Scott,Action,179800601,Top gun,PG,1986-05-16,Tom Cruise,Jim Cash,1986,375.0,356830601.0
2,Twentieth Century Fox Film Corporation,USA,James Cameron,Action,85160248,Aliens,R,1986-07-18,Sigourney Weaver,James Cameron,1986,1278.0,131368160.0
3,Walt Disney Pictures,USA,Randal Kleiser,Adventure,18564613,Flight of the navigator,PG,1986-08-01,Joey Cramer,Mark H. Baker,1986,5328.0,18564613.0
4,Hemdale,UK,Oliver Stone,Drama,138530565,Platoon,R,1987-02-06,Charlie Sheen,Oliver Stone,1986,1220.0,138545632.0

In [58]:
len(combined_gross_info)

7040

In [59]:
# Add new column and compute the international_total_revenue
combined_gross_info['international_revenue_usd'] = \
        (combined_gross_info['total_revenue_usd'] - combined_gross_info['domestic_revenue_usd'])

In [60]:
# Rename columns
combined_gross_info = combined_gross_info.rename(columns={'star':'actor'})

In [61]:
# Getting the duplicate movie by title and star released. 
dupl_combined_df = combined_gross_info.loc[combined_gross_info.duplicated(subset=["name","director", "year"]), "name"].unique()
dupl_combined_df

array(['The hitcher', 'Running scared', 'Crossroads',
       'My little pony: the movie', 'No mercy', "Nobody's fool",
       'Robocop', 'Overboard', 'Project x', 'Assassination',
       "Child's play", 'Hairspray', 'Masquerade', 'Heartbreak hotel',
       'Chocolat', 'Pet sematary', 'Always', 'Flatliners', 'Ghost',
       'Teenage mutant ninja turtles', 'Hamlet', 'The rookie',
       'The guardian', 'Happily ever after', 'Loose cannons',
       'Beauty and the beast', 'The addams family', 'Rush', 'White fang',
       'Switch', 'Shattered', 'Paradise', 'Aladdin', 'Unforgiven',
       'Forever young', 'Hero', 'Trespass', 'Gladiator',
       'The three musketeers', 'Much ado about nothing', 'Swing kids',
       'Fearless', 'For love or money', 'Matinee', 'The lion king',
       'Little women', 'The client', 'Wolf', 'Bad girls', 'Only you',
       'No escape', 'Lassie', 'Bad boys', 'Man of the house', 'Fair game',
       'The hunted', 'Mad love', 'Eye for an eye', 'Jane eyre', 'Mother',
       'Hercules', "My best friend's wedding", 'Rocketman',
       'Nothing to lose', 'Metro', 'Buddy', 'Psycho', 'Godzilla',
       'Great expectations', 'The avengers', 'Twilight', 'Firestorm',
       'The mummy', 'Tarzan', 'Life', 'Sunshine', "Charlie's angels",
       'What women want', 'Shaft', 'The gift', 'Bait',
       'Planet of the apes', 'The one', 'Head over heels', 'Pinocchio',
       'The eye', 'Peter pan', 'Freaky friday', 'The missing',
       'The return', 'Hellboy', 'The grudge',
       'Around the world in 80 days', 'Serenity', 'The longest yard',
       'The amityville horror', 'King kong', 'The island',
       'Fantastic four', 'Hide and seek', 'Sahara', 'The fog', 'Venom',
       'The illusionist', 'The host', 'The omen', 'When a stranger calls',
       'The pink panther', 'Amazing grace', 'Black christmas',
       'The last kiss', 'Halloween', 'Death at a funeral', 'Control',
       'War', 'Passengers', 'Prom night', 'Shutter', 'One missed call',
       'Friday the 13th', 'The girl with the dragon tattoo',
       'My bloody valentine', 'Brothers', 'Halloween ii', 'Bride wars',
       'Obsessed', 'Fighting', 'Fame', 'Clash of the titans',
       'A nightmare on elm street', 'Robin hood', 'The karate kid',
       'Unstoppable', 'The way back', 'Easy money', 'The thing',
       'Conan the barbarian', 'Footloose', 'Fright night', 'Anonymous',
       'Arthur', 'The hunt', 'Total recall', 'Red dawn', 'Carrie',
       'Annie', 'Neighbors', 'Endless love', 'About last night',
       'Cinderella', 'Legend', 'Everest', 'Youth', 'Poltergeist', 'Split',
       'Jackie', 'Ghostbusters', 'The jungle book', 'Ben-hur',
       "Pete's dragon"], dtype=object)

In [64]:
# Get all the data for the duplicate movie 
dupl_df = combined_gross_info.loc[combined_gross_info["name"] == "Clash of the titans"]
dupl_df

,company,country,director,genre,domestic_revenue_usd,name,rating,release_date,actor,writer,year,rank,total_revenue_usd,international_revenue_usd
5453,Warner Bros.,USA,Louis Leterrier,Action,163214888,Clash of the titans,PG-13,2010-04-02,Sam Worthington,Travis Beacham,2010,219.0,493214993.0,330000105.0
5454,Warner Bros.,USA,Louis Leterrier,Action,163214888,Clash of the titans,PG-13,2010-04-02,Sam Worthington,Travis Beacham,2010,3234.0,41092328.0,-122122560.0

In [65]:
# Remove the duplicates
clean_combined_df = combined_gross_info.drop_duplicates(subset=['name','director','year'], keep='first')
clean_combined_df

,company,country,director,genre,domestic_revenue_usd,name,rating,release_date,actor,writer,year,rank,total_revenue_usd,international_revenue_usd
0,Paramount Pictures,USA,John Hughes,Comedy,70136369,Ferris bueller's day off,PG-13,1986-06-11,Matthew Broderick,John Hughes,1986,2205.0,70712677.0,576308.0
1,Paramount Pictures,USA,Tony Scott,Action,179800601,Top gun,PG,1986-05-16,Tom Cruise,Jim Cash,1986,375.0,356830601.0,177030000.0
2,Twentieth Century Fox Film Corporation,USA,James Cameron,Action,85160248,Aliens,R,1986-07-18,Sigourney Weaver,James Cameron,1986,1278.0,131368160.0,46207912.0
3,Walt Disney Pictures,USA,Randal Kleiser,Adventure,18564613,Flight of the navigator,PG,1986-08-01,Joey Cramer,Mark H. Baker,1986,5328.0,18564613.0,0.0
4,Hemdale,UK,Oliver Stone,Drama,138530565,Platoon,R,1987-02-06,Charlie Sheen,Oliver Stone,1986,1220.0,138545632.0,15067.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7035,Fox Searchlight Pictures,UK,Mandie Fletcher,Comedy,4750497,Absolutely fabulous: the movie,R,2016-07-22,Jennifer Saunders,Jennifer Saunders,2016,3358.0,39219109.0,34468612.0
7036,Siempre Viva Productions,USA,Paul Duddridge,Drama,28368,Mothers and daughters,PG-13,2016-05-06,Selma Blair,Paige Cameron,2016,NaN,NaN,NaN
7037,Warner Bros. Animation,USA,Sam Liu,Animation,3775000,Batman: the killing joke,R,2016-07-25,Kevin Conroy,Brian Azzarello,2016,NaN,NaN,NaN
7038,Borderline Presents,USA,Nicolas Pesce,Drama,25981,The eyes of my mother,R,2016-12-02,Kika Magalhes,Nicolas Pesce,2016,NaN,NaN,NaN
7039,Les Productions du Trsor,France,Nicole Garcia,Drama,37757,From the land of the moon,R,2017-07-28,Marion Cotillard,Milena Agus,2016,6475.0,13025034.0,12987277.0

In [66]:
len(clean_combined_df)

6819

### Create movies table from combined table

In [72]:
# Re-arrange the columns and write into new table
movies = clean_combined_df[['name','total_revenue_usd','international_revenue_usd','domestic_revenue_usd',
                              'director','actor','writer','genre','rating','company','country','year']]

In [73]:
movies.head()

,name,total_revenue_usd,international_revenue_usd,domestic_revenue_usd,director,actor,writer,genre,rating,company,country,year
0,Ferris bueller's day off,70712677.0,576308.0,70136369,John Hughes,Matthew Broderick,John Hughes,Comedy,PG-13,Paramount Pictures,USA,1986
1,Top gun,356830601.0,177030000.0,179800601,Tony Scott,Tom Cruise,Jim Cash,Action,PG,Paramount Pictures,USA,1986
2,Aliens,131368160.0,46207912.0,85160248,James Cameron,Sigourney Weaver,James Cameron,Action,R,Twentieth Century Fox Film Corporation,USA,1986
3,Flight of the navigator,18564613.0,0.0,18564613,Randal Kleiser,Joey Cramer,Mark H. Baker,Adventure,PG,Walt Disney Pictures,USA,1986
4,Platoon,138545632.0,15067.0,138530565,Oliver Stone,Charlie Sheen,Oliver Stone,Drama,R,Hemdale,UK,1986

In [76]:
# Fill NaN values with zeroes
movies[['total_revenue_usd','international_revenue_usd','domestic_revenue_usd']] = \
    movies[['total_revenue_usd','international_revenue_usd','domestic_revenue_usd']].fillna(0)

In [78]:
movies.head()

,name,total_revenue_usd,international_revenue_usd,domestic_revenue_usd,director,actor,writer,genre,rating,company,country,year
0,Ferris bueller's day off,70712677.0,576308.0,70136369,John Hughes,Matthew Broderick,John Hughes,Comedy,PG-13,Paramount Pictures,USA,1986
1,Top gun,356830601.0,177030000.0,179800601,Tony Scott,Tom Cruise,Jim Cash,Action,PG,Paramount Pictures,USA,1986
2,Aliens,131368160.0,46207912.0,85160248,James Cameron,Sigourney Weaver,James Cameron,Action,R,Twentieth Century Fox Film Corporation,USA,1986
3,Flight of the navigator,18564613.0,0.0,18564613,Randal Kleiser,Joey Cramer,Mark H. Baker,Adventure,PG,Walt Disney Pictures,USA,1986
4,Platoon,138545632.0,15067.0,138530565,Oliver Stone,Charlie Sheen,Oliver Stone,Drama,R,Hemdale,UK,1986

In [ ]:
# Sort table by total revenue column
movies_sorted = movies.sort_values(by='total_revenue_usd', ascending=False)

In [88]:
# Reset index
movies_reset_index = movies_sorted.reset_index(drop=True)

In [93]:
# Sort index
movies_sort_index = movies_reset_index.sort_index()
movies_sort_index.head()

,name,total_revenue_usd,international_revenue_usd,domestic_revenue_usd,director,actor,writer,genre,rating,company,country,year
0,Avatar,2.790439e+09,2.029931e+09,760507625,James Cameron,Sam Worthington,James Cameron,Action,PG-13,Twentieth Century Fox Film Corporation,UK,2009
1,Titanic,2.195169e+09,1.536497e+09,658672302,James Cameron,Leonardo DiCaprio,James Cameron,Drama,PG-13,Twentieth Century Fox Film Corporation,USA,1997
2,Jurassic world,1.670401e+09,1.018130e+09,652270625,Colin Trevorrow,Chris Pratt,Rick Jaffa,Action,PG-13,Universal Pictures,USA,2015
3,The lion king,1.656943e+09,1.344043e+09,312900000,Roger Allers,Matthew Broderick,Irene Mecchi,Animation,G,Walt Disney Pictures,USA,1994
4,The avengers,1.518813e+09,1.495490e+09,23322832,Jeremiah S. Chechik,Ralph Fiennes,Sydney Newman,Action,PG-13,Warner Bros.,USA,1998

### Generate movie_id index

In [70]:
# Reset index
movies.reset_index()

,index,name,total_revenue_usd,international_revenue_usd,domestic_revenue_usd,director,actor,writer,genre,rating,company,country,year
0,0,Ferris bueller's day off,70712677.0,576308.0,70136369,John Hughes,Matthew Broderick,John Hughes,Comedy,PG-13,Paramount Pictures,USA,1986
1,1,Top gun,356830601.0,177030000.0,179800601,Tony Scott,Tom Cruise,Jim Cash,Action,PG,Paramount Pictures,USA,1986
2,2,Aliens,131368160.0,46207912.0,85160248,James Cameron,Sigourney Weaver,James Cameron,Action,R,Twentieth Century Fox Film Corporation,USA,1986
3,3,Flight of the navigator,18564613.0,0.0,18564613,Randal Kleiser,Joey Cramer,Mark H. Baker,Adventure,PG,Walt Disney Pictures,USA,1986
4,4,Platoon,138545632.0,15067.0,138530565,Oliver Stone,Charlie Sheen,Oliver Stone,Drama,R,Hemdale,UK,1986
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6814,7035,Absolutely fabulous: the movie,39219109.0,34468612.0,4750497,Mandie Fletcher,Jennifer Saunders,Jennifer Saunders,Comedy,R,Fox Searchlight Pictures,UK,2016
6815,7036,Mothers and daughters,NaN,NaN,28368,Paul Duddridge,Selma Blair,Paige Cameron,Drama,PG-13,Siempre Viva Productions,USA,2016
6816,7037,Batman: the killing joke,NaN,NaN,3775000,Sam Liu,Kevin Conroy,Brian Azzarello,Animation,R,Warner Bros. Animation,USA,2016
6817,7038,The eyes of my mother,NaN,NaN,25981,Nicolas Pesce,Kika Magalhes,Nicolas Pesce,Drama,R,Borderline Presents,USA,2016
6818,7039,From the land of the moon,13025034.0,12987277.0,37757,Nicole Garcia,Marion Cotillard,Milena Agus,Drama,R,Les Productions du Trsor,France,2016

In [71]:
# Sort table by total revenue
movies.sort_values(by='total_revenue_usd')

,name,total_revenue_usd,international_revenue_usd,domestic_revenue_usd,director,actor,writer,genre,rating,company,country,year
83,52 pick-up,5186646.0,0.0,5186646,John Frankenheimer,Roy Scheider,Elmore Leonard,Crime,R,Cannon Group,USA,1986
5856,Zindagi na milegi dobara,5192743.0,2116517.0,3076226,Zoya Akhtar,Hrithik Roshan,Farhan Akhtar,Adventure,Not specified,Eros International,India,2011
611,Clara's heart,5194491.0,0.0,5194491,Robert Mulligan,Whoopi Goldberg,Joseph Olshan,Drama,PG-13,MTM Enterprises,USA,1988
3615,Atanarjuat: the fast runner,5204281.0,1417480.0,3786801,Zacharias Kunuk,Natar Ungalaaq,Paul Apak Angilirq,Drama,R,Aboriginal Peoples Television Network,Canada,2001
6507,Kill the messenger,5218973.0,2768127.0,2450846,Michael Cuesta,Jeremy Renner,Peter Landesman,Biography,R,Sierra / Affinity,USA,2014
...,...,...,...,...,...,...,...,...,...,...,...,...
7032,Goat,NaN,NaN,23020,Andrew Neel,Ben Schnetzer,David Gordon Green,Drama,R,Killer Films,USA,2016
7033,The love witch,NaN,NaN,228894,Anna Biller,Samantha Robinson,Anna Biller,Comedy,UNRATED,Anna Biller Productions,USA,2016
7036,Mothers and daughters,NaN,NaN,28368,Paul Duddridge,Selma Blair,Paige Cameron,Drama,PG-13,Siempre Viva Productions,USA,2016
7037,Batman: the killing joke,NaN,NaN,3775000,Sam Liu,Kevin Conroy,Brian Azzarello,Animation,R,Warner Bros. Animation,USA,2016
7038,The eyes of my mother,NaN,NaN,25981,Nicolas Pesce,Kika Magalhes,Nicolas Pesce,Drama,R,Borderline Presents,USA,2016

In [ ]:
# Rename index column
movies = movies.rename(columns=[{'index': 'movie_id'}])

In [69]:
temp_table = movies[['name', 'director', 'actor','year']]
temp_table

                                name         director              actor  year
0           Ferris bueller's day off      John Hughes  Matthew Broderick  1986
1                            Top gun       Tony Scott         Tom Cruise  1986
2                             Aliens    James Cameron   Sigourney Weaver  1986
3            Flight of the navigator   Randal Kleiser        Joey Cramer  1986
4                            Platoon     Oliver Stone      Charlie Sheen  1986
...                              ...              ...                ...   ...
7035  Absolutely fabulous: the movie  Mandie Fletcher  Jennifer Saunders  2016
7036           Mothers and daughters   Paul Duddridge        Selma Blair  2016
7037        Batman: the killing joke          Sam Liu       Kevin Conroy  2016
7038           The eyes of my mother    Nicolas Pesce      Kika Magalhes  2016
7039       From the land of the moon    Nicole Garcia   Marion Cotillard  2016

[6819 rows x 4 columns]

In [280]:
# Get all the data for the duplicate movie 
duplicated_df = temp_table.loc[movies["name"] == "The hitcher"]
duplicated_df

             name       director         actor  year
36    The hitcher  Robert Harmon  Rutger Hauer  1986
37    The hitcher  Robert Harmon  Rutger Hauer  1986
4871  The hitcher    Dave Meyers     Sean Bean  2007
4872  The hitcher    Dave Meyers     Sean Bean  2007

In [222]:
temp_table.head()

                       name        director              actor
0  Ferris bueller's day off     John Hughes  Matthew Broderick
1                   Top gun      Tony Scott         Tom Cruise
2                    Aliens   James Cameron   Sigourney Weaver
3   Flight of the navigator  Randal Kleiser        Joey Cramer
4                   Platoon    Oliver Stone      Charlie Sheen

In [288]:
# Check for duplicates 
dupl_df = temp_table.loc[temp_table.duplicated(subset=["name","director","year"]), "name"].unique()
dupl_df

array(['The hitcher', 'Running scared', 'Crossroads',
       'My little pony: the movie', 'No mercy', "Nobody's fool",
       'Robocop', 'Overboard', 'Project x', 'Assassination',
       "Child's play", 'Hairspray', 'Masquerade', 'Heartbreak hotel',
       'Chocolat', 'Pet sematary', 'Always', 'Flatliners', 'Ghost',
       'Teenage mutant ninja turtles', 'Hamlet', 'The rookie',
       'The guardian', 'Happily ever after', 'Loose cannons',
       'Beauty and the beast', 'The addams family', 'Rush', 'White fang',
       'Switch', 'Shattered', 'Paradise', 'Aladdin', 'Unforgiven',
       'Forever young', 'Hero', 'Trespass', 'Gladiator',
       'The three musketeers', 'Much ado about nothing', 'Swing kids',
       'Fearless', 'For love or money', 'Matinee', 'The lion king',
       'Little women', 'The client', 'Wolf', 'Bad girls', 'Only you',
       'No escape', 'Lassie', 'Bad boys', 'Man of the house', 'Fair game',
       'The hunted', 'Mad love', 'Eye for an eye', 'Jane eyre', 'Mother',
       'Hercules', "My best friend's wedding", 'Rocketman',
       'Nothing to lose', 'Metro', 'Buddy', 'Psycho', 'Godzilla',
       'Great expectations', 'The avengers', 'Twilight', 'Firestorm',
       'The mummy', 'Tarzan', 'Life', 'Sunshine', "Charlie's angels",
       'What women want', 'Shaft', 'The gift', 'Bait',
       'Planet of the apes', 'The one', 'Head over heels', 'Pinocchio',
       'The eye', 'Peter pan', 'Freaky friday', 'The missing',
       'The return', 'Hellboy', 'The grudge',
       'Around the world in 80 days', 'Serenity', 'The longest yard',
       'The amityville horror', 'King kong', 'The island',
       'Fantastic four', 'Hide and seek', 'Sahara', 'The fog', 'Venom',
       'The illusionist', 'The host', 'The omen', 'When a stranger calls',
       'The pink panther', 'Amazing grace', 'Black christmas',
       'The last kiss', 'Halloween', 'Death at a funeral', 'Control',
       'War', 'Passengers', 'Prom night', 'Shutter', 'One missed call',
       'Friday the 13th', 'The girl with the dragon tattoo',
       'My bloody valentine', 'Brothers', 'Halloween ii', 'Bride wars',
       'Obsessed', 'Fighting', 'Fame', 'Clash of the titans',
       'A nightmare on elm street', 'Robin hood', 'The karate kid',
       'Unstoppable', 'The way back', 'Easy money', 'The thing',
       'Conan the barbarian', 'Footloose', 'Fright night', 'Anonymous',
       'Arthur', 'The hunt', 'Total recall', 'Red dawn', 'Carrie',
       'Annie', 'Neighbors', 'Endless love', 'About last night',
       'Cinderella', 'Legend', 'Everest', 'Youth', 'Poltergeist', 'Split',
       'Jackie', 'Ghostbusters', 'The jungle book', 'Ben-hur',
       "Pete's dragon"], dtype=object)

In [290]:
# Get all the data for the duplicate movie 
duplicated_df = temp_table.loc[temp_table["name"] == "The hitcher"]
duplicated_df

             name       director         actor  year
36    The hitcher  Robert Harmon  Rutger Hauer  1986
37    The hitcher  Robert Harmon  Rutger Hauer  1986
4871  The hitcher    Dave Meyers     Sean Bean  2007
4872  The hitcher    Dave Meyers     Sean Bean  2007

In [ ]:
# Check data types

### Extract Movie Rating data into a separate table

In [57]:
# Save rating into a separate table
rating = domestic_gross_info['rating']

In [58]:
# Drop duplicates
rating = rating.drop_duplicates(keep='first')

In [59]:
rating

0               PG-13
1                  PG
2                   R
21            UNRATED
31      Not specified
40                  G
94              NC-17
338         NOT RATED
1248            TV-PG
2195            TV-MA
3255                B
3948              B15
6575            TV-14
Name: rating, dtype: object

In [60]:
rating.head(2)

0    PG-13
1       PG
Name: rating, dtype: object

In [61]:
# Push rating table to sql
rating.to_sql(name='rating', con=engine, if_exists='append', index=False)

In [62]:
# Check if written successfully
pd.read_sql_query('select * from rating', con=engine).head()

          rating  rating_id
0          PG-13          1
1             PG          2
2              R          3
3        UNRATED          4
4  Not specified          5

In [63]:
# Check the size
pd.read_sql_query('select count(*) from rating', con=engine).head()

   count
0     26

In [64]:
# Check all tables in the database
engine.table_names()

['movies',
 'actor',
 'writer',
 'director',
 'total_gross_info',
 'rating',
 'genre',
 'country',
 'company',
 'combined_gross_info',
 'temp_movie_id_name',
 'domestic_gross_info']

### Extract Country data into a separate table

In [65]:
# Save Country data into a separate table
country = domestic_gross_info['country']

In [66]:
# Drop duplicates
country = country.drop_duplicates(keep='first')

In [67]:
country

0                                  USA
4                                   UK
9                            Australia
25                               Italy
31                              France
60                              Sweden
84                               Japan
94                               Spain
122                        Switzerland
131                             Canada
135                             Israel
152                        Netherlands
177                          Argentina
185                            Denmark
262                       West Germany
388                          Hong Kong
421                            Belgium
502                            Ireland
564                       South Africa
828                            Hungary
989                               Iran
1013                       New Zealand
1028                           Germany
1060                             China
1086                              Peru
1096                      Soviet Union
1269                            Mexico
1314                            Brazil
1498                            Taiwan
1534                             India
1571                           Austria
1616                          Portugal
1733                              Cuba
1903             Republic of Macedonia
1908                            Russia
2156                            Greece
2544                            Norway
2625                           Romania
2750                           Jamaica
2759    Federal Republic of Yugoslavia
2794                             Aruba
2898                    Czech Republic
3029                       South Korea
3293                           Finland
3882                          Thailand
4135                          Colombia
4394                         Palestine
5570                         Indonesia
5920                      Saudi Arabia
5927                             Chile
6131                            Poland
6346                             Kenya
6352                           Bahamas
6368                           Ukraine
6531                           Iceland
6663                             Malta
6780                            Panama
Name: country, dtype: object

In [68]:
# Push rating table to sql
country.to_sql(name='country', con=engine, if_exists='append', index=False)

In [69]:
# Check if written successfully
pd.read_sql_query('select * from country', con=engine).head()

     country  country_id
0        USA           1
1         UK           2
2  Australia           3
3      Italy           4
4     France           5

In [70]:
# Check the size
pd.read_sql_query('select count(*) from country', con=engine).head()

   count
0    114

In [71]:
# Check all tables in the database
engine.table_names()

['movies',
 'actor',
 'writer',
 'director',
 'total_gross_info',
 'rating',
 'genre',
 'country',
 'company',
 'combined_gross_info',
 'temp_movie_id_name',
 'domestic_gross_info']

### Extract Star Actor data into a separate table

In [72]:
# Save star_actor data into a separate table
actor = domestic_gross_info['star']

In [73]:
# Drop duplicates
actor = actor.drop_duplicates(keep='first')

In [74]:
print(actor)

0       Matthew Broderick
1              Tom Cruise
2        Sigourney Weaver
3             Joey Cramer
4           Charlie Sheen
              ...
6810        Griffin Gluck
6811        Ben Schnetzer
6812    Samantha Robinson
6814    Jennifer Saunders
6817        Kika Magalhes
Name: star, Length: 2504, dtype: object

In [75]:
# Push rating table to sql
actor.to_sql(name='actor', con=engine, if_exists='append', index=False)

In [76]:
# Check if written successfully
pd.read_sql_query('select * from actor', con=engine).head(2)

                star  actor_id
0  Matthew Broderick         1
1         Tom Cruise         2

In [77]:
# Check if written successfully
pd.read_sql_query('select count(*) from actor', con=engine).head(2)

   count
0   5008

In [78]:
# Check all tables in the database
engine.table_names()

['movies',
 'actor',
 'writer',
 'director',
 'total_gross_info',
 'rating',
 'genre',
 'country',
 'company',
 'combined_gross_info',
 'temp_movie_id_name',
 'domestic_gross_info']

### Extract Company data into a separate table

In [79]:
# Save company data into a separate table
company = domestic_gross_info['company']

In [80]:
# Drop duplicates
company = company.drop_duplicates(keep='first')

In [81]:
company

0                           Paramount Pictures
2       Twentieth Century Fox Film Corporation
3                         Walt Disney Pictures
4                                      Hemdale
5                       Henson Associates (HA)
                         ...
6803                            Digic Pictures
6805               Bing Feng Bao Entertainment
6812                   Anna Biller Productions
6815                  Siempre Viva Productions
6817                       Borderline Presents
Name: company, Length: 2179, dtype: object

In [82]:
# Push company table to sql
company.to_sql(name='company', con=engine, if_exists='append', index=False)

In [83]:
# Check if written successfully
pd.read_sql_query('select * from company', con=engine).head()

                                  company  company_id
0                      Paramount Pictures           1
1  Twentieth Century Fox Film Corporation           2
2                    Walt Disney Pictures           3
3                                 Hemdale           4
4                  Henson Associates (HA)           5

In [84]:
# Check the size
pd.read_sql_query('select count(*) from company', con=engine).head()

   count
0   4358

In [85]:
# Check all tables in the database
engine.table_names()

['movies',
 'actor',
 'writer',
 'director',
 'total_gross_info',
 'rating',
 'genre',
 'country',
 'company',
 'combined_gross_info',
 'temp_movie_id_name',
 'domestic_gross_info']

### Extract Movie Genre data into a separate table

In [86]:
# Save movie genre data into a separate table
movie_genre = domestic_gross_info['genre']

In [87]:
# Drop duplicates
movie_genre = movie_genre.drop_duplicates(keep='first')

In [88]:
print(movie_genre)

0          Comedy
1          Action
3       Adventure
4           Drama
13          Crime
36       Thriller
38         Horror
40      Animation
41      Biography
86         Sci-Fi
133       Musical
189        Family
270       Fantasy
380       Mystery
542           War
603       Romance
1702      Western
Name: genre, dtype: object

In [89]:
# Push movie_genre table to sql
movie_genre.to_sql(name='genre', con=engine, if_exists='append', index=False)

In [90]:
# Check if written successfully
pd.read_sql_query('select * from genre', con=engine).head()

       genre  genre_id
0     Comedy         1
1     Action         2
2  Adventure         3
3      Drama         4
4      Crime         5

In [91]:
# Check if written successfully
pd.read_sql_query('select count(*) from genre', con=engine).head()

   count
0     34

In [92]:
# Check all tables in the database
engine.table_names()

['movies',
 'actor',
 'writer',
 'director',
 'total_gross_info',
 'rating',
 'genre',
 'country',
 'company',
 'combined_gross_info',
 'temp_movie_id_name',
 'domestic_gross_info']

### Extract Writer data into a separate table

In [93]:
# Save Writer data into a separate table
writer = domestic_gross_info['writer']

In [94]:
# Drop duplicates
writer = writer.drop_duplicates(keep='first')

In [95]:
print(writer)

0             John Hughes
1                Jim Cash
2           James Cameron
3           Mark H. Baker
4            Oliver Stone
              ...
6814    Jennifer Saunders
6815        Paige Cameron
6816      Brian Azzarello
6817        Nicolas Pesce
6818          Milena Agus
Name: writer, Length: 4199, dtype: object

In [96]:
# Push writer table to sql
writer.to_sql(name='writer', con=engine, if_exists='append', index=False)

In [97]:
# Check if written successfully
pd.read_sql_query('select * from writer', con=engine).head()

          writer  writer_id
0    John Hughes          1
1       Jim Cash          2
2  James Cameron          3
3  Mark H. Baker          4
4   Oliver Stone          5

In [98]:
# Check if written successfully
pd.read_sql_query('select count(*) from writer', con=engine).head()

   count
0   8398

In [99]:
# Check all tables in the database
engine.table_names()

['movies',
 'actor',
 'writer',
 'director',
 'total_gross_info',
 'rating',
 'genre',
 'country',
 'company',
 'combined_gross_info',
 'temp_movie_id_name',
 'domestic_gross_info']

### Extract Director data from Domestic Gross Info table

In [100]:
# Save data into a separate table
director = domestic_gross_info['director']

In [101]:
# Drop duplicates
director = director.drop_duplicates(keep='first')

In [102]:
director

0           John Hughes
1            Tony Scott
2         James Cameron
3        Randal Kleiser
4          Oliver Stone
             ...
6814    Mandie Fletcher
6815     Paul Duddridge
6816            Sam Liu
6817      Nicolas Pesce
6818      Nicole Garcia
Name: director, Length: 2759, dtype: object

In [103]:
# Push the table to sql
director.to_sql(name='director', con=engine, if_exists='append', index=False)

In [104]:
# Check if written successfully
pd.read_sql_query('select * from director', con=engine).head()

         director  director_id
0     John Hughes            1
1      Tony Scott            2
2   James Cameron            3
3  Randal Kleiser            4
4    Oliver Stone            5

In [105]:
# Check if written successfully
pd.read_sql_query('select count(*) from director', con=engine).head()

   count
0   5518

In [106]:
# Check all tables in the database
engine.table_names()

['movies',
 'actor',
 'writer',
 'director',
 'total_gross_info',
 'rating',
 'genre',
 'country',
 'company',
 'combined_gross_info',
 'temp_movie_id_name',
 'domestic_gross_info']

### Extract actor_movie data from Domestic Gross Info table

In [107]:
# Save data into a separate table
actor_movie = domestic_gross_info[['director','star']]

In [108]:
# Drop duplicates
director = director.drop_duplicates(keep='first')

In [109]:
director

0           John Hughes
1            Tony Scott
2         James Cameron
3        Randal Kleiser
4          Oliver Stone
             ...
6814    Mandie Fletcher
6815     Paul Duddridge
6816            Sam Liu
6817      Nicolas Pesce
6818      Nicole Garcia
Name: director, Length: 2759, dtype: object

In [110]:
# Push the table to sql
director.to_sql(name='director', con=engine, if_exists='append', index=False)

In [111]:
# Check if written successfully
pd.read_sql_query('select * from director', con=engine).head()

         director  director_id
0     John Hughes            1
1      Tony Scott            2
2   James Cameron            3
3  Randal Kleiser            4
4    Oliver Stone            5

In [112]:
# Check if written successfully
pd.read_sql_query('select count(*) from director', con=engine).head()

   count
0   8277

In [113]:
# Check all tables in the database
engine.table_names()

['movies',
 'actor',
 'writer',
 'director',
 'total_gross_info',
 'rating',
 'genre',
 'country',
 'company',
 'combined_gross_info',
 'temp_movie_id_name',
 'domestic_gross_info']